app/controllers/pages_controller.rb

    def text_chat
        @messages = Message.all
---
SELECT `messages`.* FROM `messages`