app/controllers/uploads_controller.rb

  def create
    @upload = Upload.new(upload_params)
    # upload status:200 means no error returned
    # upload status:400 means error returned
    if @upload.save
---
INSERT INTO `uploads` (`created_at`, `updated_at`) VALUES ('2016-10-18 15:02:47', '2016-10-18 15:02:47')